## Pandas Eval() and Query()

### Paulo Cysne Rios Jr. | Oct 23, 2017

In [1]:
import pandas as pd

In [2]:
sales = pd.DataFrame({"Shoes": [230, 568, 985],
                     "Clothing": [1716, 1412, 2387],
                     "Music": [12899, 7187, 19256],
                     "Books": [5549, 2318, 1426],
                     "Stores": ["Las Vegas", 
                                "Orlando", 
                                "Los Angeles"]})

In [3]:
sales

   Books  Clothing  Music  Shoes       Stores
0   5549      1716  12899    230    Las Vegas
1   2318      1412   7187    568      Orlando
2   1426      2387  19256    985  Los Angeles

### Filtering with Query()

In [4]:
sales.query('Music > 10000 and Books > 2000')

   Books  Clothing  Music  Shoes     Stores
0   5549      1716  12899    230  Las Vegas

### Performing computations with Eval()

In [5]:
sales.eval("Music + Books")

0    18448
1     9505
2    20682
dtype: int64

### Creating a new column with Eval()

In [6]:
sales.eval("Total = Shoes + Clothing + Music + Books", 
           inplace = True)

In [7]:
sales

   Books  Clothing  Music  Shoes       Stores  Total
0   5549      1716  12899    230    Las Vegas  20394
1   2318      1412   7187    568      Orlando  11485
2   1426      2387  19256    985  Los Angeles  24054

### Setting the index

In [10]:
sales.set_index("Stores", inplace = True)

In [11]:
sales

             Books  Clothing  Music  Shoes  Total
Stores
Las Vegas     5549      1716  12899    230  20394
Orlando       2318      1412   7187    568  11485
Los Angeles   1426      2387  19256    985  24054

### Eval() results with new index

In [14]:
sales.eval("Music + Books")

Stores
Las Vegas      18448
Orlando         9505
Los Angeles    20682
dtype: int64

In [12]:
sales.eval("Total = Shoes + Clothing + Music + Books", 
           inplace = True)

In [13]:
sales

             Books  Clothing  Music  Shoes  Total
Stores
Las Vegas     5549      1716  12899    230  20394
Orlando       2318      1412   7187    568  11485
Los Angeles   1426      2387  19256    985  24054